// {
// /* нахожд мин среди 2 чис */
// let x, y, z, min;
// x = parseInt(prompt("Введите 1 чис"))
// y = parseInt(prompt("Введите 2 чис"))
// z = parseInt(prompt("Введите 3 чис"))
// min = x;
// if(x < min)
// {
//     min = y
// }
// if(z < min)
// {
//     min = z
// }
// alert("min = " + min);
// }
// {
//     /*вывести нечет числа от 0 до 10 */
//     for (let i = 1; i < 10; i+=2)
//     {
//         console.log(i);
//     }
// }

// {
//     /* найти кол-во нечет чисел последовательностию. 
//     последовательность чисел вводится с клавиатуры и заканчиваются вводом 0 */
//     let count = 0, x;
//     x = parseInt(prompt("Введите число"));
//     while(x!=0)
//     {
//         if(x%2 != 0)
//         {
//             count++
//         }
//         x = parseInt(prompt("Введите число"));
//     }
//     alert("кол-во нечет чис " + count)
// }
// {
//     /*найти кол-во нечет цифр в натуральном числе*/
//     let count = 0, d, x;
//     x = parseInt(prompt("Введите натуральное число"))
//     while (x != 0){
//         d = x % 10;
//         if (d % 2 != 0)
//         {
//             count++
//         }
//         x = Math.floor(x / 10);
//     }
//     alert("кол-во: " + count)
// }




/*--------------------------------------------1---------------------------------------------*/
//let max = a > b ? a: b;
/*
4.25 Дано двузначное число. Определить:
а) является ли сумма его цифр двузначным числом;
б) больше ли числа а сумма его цифр.
*/
// {
// let num = parseInt(prompt("введ двузначное число"))
// let a = Math.floor(num / 10); 
// let b = num % 10;             
// let sum = a + b;

// let otvA = sum >= 10 ? "А) ДА" : "А) нте";
// let otbB = sum > a ? "Б) да" : "Б)нет";

// alert(otvA + " " + otbB)
// }


/*-------------------------------------------2----------------------------------------------*/
/*4.47. Определить, является ли треугольник со сторонами a, b, c равнобедренным.*/
// let a = parseInt(prompt("введ 1 стор")), b = parseInt(prompt("введ 2 стор")), c = parseInt(prompt("введ 3 стор"))

// if (a + b > c && a + c > b && b + c > a) 
// {
//     if (a == b || a == c || b == c) 
//         {
//             alert("да")
//         }
//         else{
//             alert("не")
//         }
// }
// else {
//     alert("это не треугольник")
// }

/*-------------------------------------------3----------------------------------------------*/
/*
5.34. Вычислить сумму 1 + 1/3 + 1/(3^2) + ... + 1/(3^8). 
Операцию возведения в степень не использовать.
*/



// let sum = 0, d = 1;

// for (let i = 0; i <= 8; i++) {
//     sum += 1 / d;
//     d *= 3; 
// }

// console.log(sum); 


/*-------------------------------------------4----------------------------------------------*/
/*
5.40. Даны натуральное число n и вещественные числа
a1, a2, ..., an.
Определить сумму всех вещественных чисел.
*/


// let a, sum = 0;
//     let nn = parseInt(prompt("Введите кол-во вещ чисел"))
//     for(let i = 0; i <= nn-1; i++)
//     {
//         a = parseFloat(prompt("Введите вещ число"));
//         sum += a
//     }
//     alert("сумма: " + parseFloat(sum))




/*-------------------------------------------5----------------------------------------------*/
/*
6.46 (a, b). Дано натуральное число.
а) Верно ли, что сумма его цифр больше 10?
б) Верно ли, что произведение его цифр меньше 50?
*/

// let x = parseInt(prompt("Введите число")), d, sum = 0, b2 = 1;
// while (x != 0){
//     d = x % 10;
//     sum += d
//     b2 *= d
//     x = Math.floor(x / 10)
// }
// if (sum > 10) alert("a) да")
// else alert("a) нет")
// if (b2 < 50) alert("b) да")
// if (b2 > 50) alert("b) нет")
